blog/20171107-aBugWorthofAWorkday.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-19 Mon 19:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>价值一个工作日的BUG</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shuchaoma" />
<link rel="stylesheet" type="text/css" href="https://www.shuchaoma.com/css/stylesheet.css">
<link rel="shortcut icon" href="/css/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">价值一个工作日的BUG</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8c50656">1. 背景描述</a></li>
<li><a href="#orgeb3aeb9">2. 问题描述</a></li>
<li><a href="#org9d62707">3. 原因分析</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8c50656" class="outline-2">
<h2 id="org8c50656"><span class="section-number-2">1</span> 背景描述</h2>
<div class="outline-text-2" id="text-1">
<p>
因为项目需要，一个模块（称之为模块A）的交互协议发生了变化，从而与其交互的模块（称为模块B）需要进行协议适配改造。
模块A设计的交互协议通过二进制传输，格式也很简答，其中第一部分为prefix:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">version</th>
<th scope="col" class="org-left">mode</th>
<th scope="col" class="org-left">length</th>
<th scope="col" class="org-left">size</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">uint32</td>
<td class="org-left">uint32</td>
<td class="org-left">uint32</td>
<td class="org-left">uint32</td>
</tr>
</tbody>
</table>

<p>
前期没有考虑到第四个字段size空间不足情况，协议v2需要将第四个字段从int32类型改为int64。
</p>
</div>
</div>

<div id="outline-container-orgeb3aeb9" class="outline-2">
<h2 id="orgeb3aeb9"><span class="section-number-2">2</span> 问题描述</h2>
<div class="outline-text-2" id="text-2">
<p>
模块B使用python撰写；众说周知python对二进制的处理（尤其网络交互、文件解析方面）通过struct模块进行包装（pack）与（unpack）。
当初错误的修改方案是：直接修改struct.pack()中的fmt，没有考虑C语言（编译器）需要的结构体对齐的因素。
注：内存对齐理论参考 <a href="http://www.cnblogs.com/motadou/archive/2009/01/17/1558438.html">结构体对其详解</a>
</p>
<div class="org-src-container">
<pre class="src src-python">&#20462;&#25913;&#21069;&#31034;&#20363;&#65306;
<span style="color: #e7c547;">lst</span> = <span style="color: #eaeaea;">(</span>1, 2, 3, 4<span style="color: #eaeaea;">)</span>
<span style="color: #e7c547;">data</span> = struct.pack<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"4I"</span>, *lst<span style="color: #eaeaea;">)</span>
&#20462;&#25913;&#21518;&#31034;&#20363;&#65306;
<span style="color: #e7c547;">lst</span> = <span style="color: #eaeaea;">(</span>1, 2, 3, 4<span style="color: #eaeaea;">)</span>
<span style="color: #e7c547;">data</span> = struct.pack<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"3IQ"</span>, *lst<span style="color: #eaeaea;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d62707" class="outline-2">
<h2 id="org9d62707"><span class="section-number-2">3</span> 原因分析</h2>
<div class="outline-text-2" id="text-3">
<p>
个人系统64bit Linux，python默认情况安装系统8字节对齐，直接导致该结构体生成的二进制流并非预期的20字节，而是多出四个字节-24字节，从而模块A无法识别。如下图：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">内存地址向下增长</th>
<th scope="col" class="org-left">item</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">uint32</td>
<td class="org-left">mode</td>
</tr>

<tr>
<td class="org-left">uint32</td>
<td class="org-left">version</td>
</tr>

<tr>
<td class="org-left">uint32</td>
<td class="org-left">length</td>
</tr>

<tr>
<td class="org-left">null(填充)</td>
<td class="org-left">padding</td>
</tr>

<tr>
<td class="org-left">uint64</td>
<td class="org-left">size</td>
</tr>
</tbody>
</table>

<p>
正确的方法应该是在pack函数的fmt中指定为“紧密排列”<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #b9ca4a;">import</span> struct
&gt;&gt;&gt; <span style="color: #e7c547;">lst</span>=<span style="color: #eaeaea;">(</span>1, 2, 3, 4<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #e7c547;">data</span> = struct.pack<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"4I"</span>, 1, 2, 3, 4<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; struct.calcsize<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"4I"</span><span style="color: #eaeaea;">)</span>
16
&gt;&gt;&gt; <span style="color: #e7c547;">data</span> = struct.pack<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"3IQ"</span>, 1, 2, 3, 4<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; struct.calcsize<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"3IQ"</span><span style="color: #eaeaea;">)</span>
24
&gt;&gt;&gt; <span style="color: #e7c547;">data</span> = struct.pack<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"=3IQ"</span>, 1, 2, 3, 4<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; struct.calcsize<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"=3IQ"</span><span style="color: #eaeaea;">)</span>
20
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.python.org/2/library/struct.html#byte-order-size-and-alignment">python struct: byte-order-size-alignment</a>
</p></div></div>


</div>
</div></div>
</body>
</html>
